Tekla Open API Reference for Tekla Structures 2025
CurvedDimensionSetBaseAttributes Constructor
Overload List
Name | Description
CurvedDimensionSetBase.CurvedDimensionSetBaseAttributes()
 Creates a new curved dimension set base attributes instance which loads standard attributes.
CurvedDimensionSetBase.CurvedDimensionSetBaseAttributes(String)
 Creates a new curved dimension set base attributes instance that loads the specified attributes.
Top
See Also
Reference
CurvedDimensionSetBase.CurvedDimensionSetBaseAttributes Class
Tekla.Structures.Drawing Namespace